# APP测试流程

说实话我的文笔有点差，构思了很久没想出像其他博主那样将文章写的那么引人入胜，不过还好写的是技术文章，只要能够把自己的观点说清楚也算是一篇能看的下去的文章（ps: 自我安慰~）。

不过在开始讲具体内容之前还是要唠叨一下，在移动互联网的历史里，2007 年乔帮主发布第一代 iPhone，从那以后，App 伴随 3G → 4G → 5G 的演进，已经走过了将近 20 年的发展历程。应用的形态层出不穷，从最初的通讯、工具，到如今的支付、出行、娱乐、AI 助手，几乎覆盖了我们生活的方方面面。

随着功能越来越复杂、用户体验要求越来越高，App 测试也从最初的“点点点”逐步成长为一套完整的质量保障体系。
今天的测试不仅要考虑功能是否正确，还要关注性能、兼容性、安全性，以及在复杂网络环境和海量机型下的稳定性。

对于Web3领域来说大多说的都是10人左右的创业团队，很少会有专门的测试工程师保证软件的质量，所以想通过几篇文章简单梳理一下App质量保证流程，算是对自己知识做个总结，也说一下为什么测试总是给你提bug（开发老师口头禅：时间都用来给你解bug了）。（App测试流程、测试用例设计、自动化测试框架、STF多机并行测试、Jenkins持续集成/持续部署、专项测试（冷启动、热启动、性能、耗电、兼容））

## 测试流程

对于开发来说拿到一个从测试角度来说拿到一个app（或某个功能模块）的需求后要进行开发测试流程分为下面11个步骤：

* 需求分析：分析公司内部开发和产品提供的文档，比如产品原型图、产品PRD、开发的技术方案、产品架构图等

测试计划编写

测试用例设计

测试用例评审

用例执行

回归测试

非功能测试

走查验收（UI、产品）

测试总结报告

灰度发布

上线


## 测试用例设计


## 常见缺陷
